app/controllers/api/products_controller.rb

INSERT INTO "products" ("product_name", "description", "price", "created_at", "updated_at", "pic_url") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create
        @product = Product.new(product_params)

        if @product.save