app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "Y7d2YdFQWXZhrzUz07qKcw"], ["updated_at", "2020-07-28 20:40:37.503123"], ["id", 2]]
---
    def reset_session_token!
        self.session_token = self.class.generate_session_token
        self.save!